tsung_tests/tsung_comments_final.xml
<?xml version="1.0"?>
<!DOCTYPE tsung SYSTEM "/usr/local/share/tsung/tsung-1.0.dtd" [] >
<tsung loglevel="notice">
  <clients>
    <client host="localhost" maxusers="1000" use_controller_vm="true" />
  </clients>

  <servers>
    <server host="avani-test.eba-fz2dfqnp.us-west-2.elasticbeanstalk.com" port="80" type="tcp"></server>
  </servers>

  <load>
    <arrivalphase phase="1" duration="10" unit="second">
      <users arrivalrate="2" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="2" duration="10" unit="second">
      <users arrivalrate="4" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="3" duration="10" unit="second">
      <users arrivalrate="8" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="4" duration="10" unit="second">
      <users arrivalrate="16" unit="second"></users>
    </arrivalphase>
  </load>

  <options>
    <!-- Set connection timeout to 2 seconds -->
    <option name="global_ack_timeout" value="2000"></option>
  </options>

  <sessions>

    <session name="comments" weight="1" type="ts_http">


       <!--  1) User logs in -->
      <!-- LOGIN -->
      <request>
          <dyn_variable name="authenticity_token" ></dyn_variable>
          <http url='/d/users/sign_in/' version='1.1' method='GET'></http>
      </request>

      <!-- wait for up to 2 seconds, user is typing names -->
      <thinktime value="2" random="true"></thinktime>

      <!-- create a random number to make a unique first name -->
      <setdynvars sourcetype="random_number" start="1" end="100">
          <var name="random_num" />
      </setdynvars>

      <!-- user log in -->
      <request subst="true">
          <http
          url='/d/users/sign_in/'
          version='1.1'
          method='POST'
          content_type="application/x-www-form-urlencoded"
          contents='authenticity_token=%%_authenticity_token%%&amp;user%5Bemail%5D=user_%%_random_num%%%40gmail.com&amp;user%5Bpassword%5D=Password1234&amp;user%5Bremember_me%5D=0&amp;commit=Log+in'>
          </http>
      </request>

        <!-- VIEW POST -->
        <request>
          <dyn_variable name="post_url" xpath="/html/body//div[@class='card-body']//p/a/@href"></dyn_variable> 
          <http url='/posts/' version='1.1' method='GET'></http>
        </request>

        <setdynvars sourcetype="eval"
          code='fun({Pid,DynVars})->
          {ok,Val}=ts_dynvars:lookup(post_url,DynVars),
          lists:last(Val) end.' >
          <var name="last_post_url" />
        </setdynvars>





        <!-- wait for up to 2 seconds -->
        <!-- <thinktime value="2" random="true"></thinktime> -->
        <setdynvars sourcetype="random_string" length="20">
            <var name="random_string" />
        </setdynvars>

        <!-- GET POST -->
        <request subst="true">
            <dyn_variable name="comment_authenticity_token_one" xpath="//head/meta[@name='csrf-token']/@content"></dyn_variable>
            <http
            url='/%%_last_post_url%%/'
            version='1.1'
            method='GET'>
            </http>
        </request>

        <!--POST COMMENT-->
        <request subst="true">
            <http url="/%%_last_post_url%%/comments" version='1.1' method="POST"
            content_type="application/x-www-form-urlencoded"
            contents='authenticity_token=%%_comment_authenticity_token_one%%&amp;comment%5Bbody%5D=%%_random_string%%&amp;commit=Create+Comment'>
            </http>
        </request>

         <!-- wait for up to 2 seconds, user is typing names -->
        <thinktime value="2" random="true"></thinktime>

        <request subst="true">
            <dyn_variable name="comment_authenticity_token_two" xpath="//head/meta[@name='csrf-token']/@content"></dyn_variable>
            <dyn_variable name="delete_comment_url" xpath="/html/body//div[@class='container']//p/a/@href"></dyn_variable> 
            <http
            url='/%%_last_post_url%%/'
            version='1.1'
            method='GET'>
            </http>
        </request>

        <setdynvars sourcetype="eval"
          code='fun({Pid,DynVars})->
          {ok,Val}=ts_dynvars:lookup(delete_comment_url,DynVars),
          lists:last(Val) end.' >
          <var name="last_delete_comment_url" />
        </setdynvars>

        <!--DELETE COMMENT-->
        <request subst="true">
            <http url="/%%_last_delete_comment_url%%/" version='1.1' method="POST"
            content_type="application/x-www-form-urlencoded"
            contents="_method=delete&amp;authenticity_token=%%_comment_authenticity_token_two%%">
            </http>
        </request>


        <!--LOGOUT-->
        <request>
            <dyn_variable name="users_profile_authenticity_token_logout" xpath="//head/meta[@name='csrf-token']/@content"></dyn_variable>
            <http url='/users/profile' version='1.1' method='GET'></http>
        </request>

        <request subst="true">
            <http url='/d/users/sign_out'
            version='1.1'
            method='POST'
            content_type="application/x-www-form-urlencoded"
            contents='_method=delete&amp;authenticity_token=%%_users_profile_authenticity_token_logout%%'>
            </http>
        </request>
        
    </session>
    
  </sessions>
</tsung>